In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/gapminder.csv')

In [3]:
df.head()

       country continent  year  lifeExp  population   gdpPerCap
0  Afghanistan      Asia  1952   28.801     8425333  779.445314
1  Afghanistan      Asia  1957   30.332     9240934  820.853030
2  Afghanistan      Asia  1962   31.997    10267083  853.100710
3  Afghanistan      Asia  1967   34.020    11537966  836.197138
4  Afghanistan      Asia  1972   36.088    13079460  739.981106

In [4]:
df.tail()

       country continent  year  lifeExp  population   gdpPerCap
1699  Zimbabwe    Africa  1987   62.351     9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377    10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809    11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989    11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487    12311143  469.709298

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.shape

(1704, 6)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   continent   1704 non-null   object
 2   year        1704 non-null   int64
 3   lifeExp     1704 non-null   float64
 4   population  1704 non-null   int64
 5   gdpPerCap   1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [8]:
df.describe()

             year      lifeExp    population      gdpPerCap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

## Columns

In [9]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap'], dtype='object')

In [10]:
columns = ['country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap']

In [11]:
df.keys()

Index(['country', 'continent', 'year', 'lifeExp', 'population', 'gdpPerCap'], dtype='object')

In [12]:
df['country'].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [13]:
df[['country', 'lifeExp', 'gdpPerCap']].head()

       country  lifeExp   gdpPerCap
0  Afghanistan   28.801  779.445314
1  Afghanistan   30.332  820.853030
2  Afghanistan   31.997  853.100710
3  Afghanistan   34.020  836.197138
4  Afghanistan   36.088  739.981106

In [14]:
 df.drop('continent', axis=1)

          country  year  lifeExp  population   gdpPerCap
0     Afghanistan  1952   28.801     8425333  779.445314
1     Afghanistan  1957   30.332     9240934  820.853030
2     Afghanistan  1962   31.997    10267083  853.100710
3     Afghanistan  1967   34.020    11537966  836.197138
4     Afghanistan  1972   36.088    13079460  739.981106
...           ...   ...      ...         ...         ...
1699     Zimbabwe  1987   62.351     9216418  706.157306
1700     Zimbabwe  1992   60.377    10704340  693.420786
1701     Zimbabwe  1997   46.809    11404948  792.449960
1702     Zimbabwe  2002   39.989    11926563  672.038623
1703     Zimbabwe  2007   43.487    12311143  469.709298

[1704 rows x 5 columns]

In [15]:
df

          country continent  year  lifeExp  population   gdpPerCap
0     Afghanistan      Asia  1952   28.801     8425333  779.445314
1     Afghanistan      Asia  1957   30.332     9240934  820.853030
2     Afghanistan      Asia  1962   31.997    10267083  853.100710
3     Afghanistan      Asia  1967   34.020    11537966  836.197138
4     Afghanistan      Asia  1972   36.088    13079460  739.981106
...           ...       ...   ...      ...         ...         ...
1699     Zimbabwe    Africa  1987   62.351     9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377    10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809    11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989    11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487    12311143  469.709298

[1704 rows x 6 columns]

## Rows

In [ ]:
# loc - labels
# iloc - index

In [16]:
df.iloc[700]

country           India
continent          Asia
year               1972
lifeExp          50.651
population    567000000
gdpPerCap       724.033
Name: 700, dtype: object

In [17]:
df.iloc[[1, 10 ,100]]

         country continent  year  lifeExp  population   gdpPerCap
1    Afghanistan      Asia  1957   30.332     9240934  820.853030
10   Afghanistan      Asia  2002   42.129    25268405  726.734055
100   Bangladesh      Asia  1972   45.252    70759295  630.233627

In [18]:
df.loc[[1, 10, 100]]

         country continent  year  lifeExp  population   gdpPerCap
1    Afghanistan      Asia  1957   30.332     9240934  820.853030
10   Afghanistan      Asia  2002   42.129    25268405  726.734055
100   Bangladesh      Asia  1972   45.252    70759295  630.233627

In [19]:
df.iloc[-1]

country       Zimbabwe
continent       Africa
year              2007
lifeExp         43.487
population    12311143
gdpPerCap      469.709
Name: 1703, dtype: object

In [24]:
df.iloc[25:200]

          country continent  year  lifeExp  population    gdpPerCap
25        Algeria    Africa  1957   45.685    10270856  3013.976023
26        Algeria    Africa  1962   48.303    11000948  2550.816880
27        Algeria    Africa  1967   51.407    12760499  3246.991771
28        Algeria    Africa  1972   54.518    14760787  4182.663766
29        Algeria    Africa  1977   58.014    17152804  4910.416756
..            ...       ...   ...      ...         ...          ...
195  Burkina Faso    Africa  1967   40.697     5127935   794.826560
196  Burkina Faso    Africa  1972   43.591     5433886   854.735976
197  Burkina Faso    Africa  1977   46.137     5889574   743.387037
198  Burkina Faso    Africa  1982   48.122     6634596   807.198586
199  Burkina Faso    Africa  1987   49.557     7586551   912.063142

[175 rows x 6 columns]

In [22]:
df.loc[1:7]

       country continent  year  lifeExp  population   gdpPerCap
1  Afghanistan      Asia  1957   30.332     9240934  820.853030
2  Afghanistan      Asia  1962   31.997    10267083  853.100710
3  Afghanistan      Asia  1967   34.020    11537966  836.197138
4  Afghanistan      Asia  1972   36.088    13079460  739.981106
5  Afghanistan      Asia  1977   38.438    14880372  786.113360
6  Afghanistan      Asia  1982   39.854    12881816  978.011439
7  Afghanistan      Asia  1987   40.822    13867957  852.395945

In [30]:
df.iloc[1:4, 0:4]

       country continent  year  lifeExp
1  Afghanistan      Asia  1957   30.332
2  Afghanistan      Asia  1962   31.997
3  Afghanistan      Asia  1967   34.020

In [34]:
df.loc[1:100, 'country']

1      Afghanistan
2      Afghanistan
3      Afghanistan
4      Afghanistan
5      Afghanistan
          ...
96      Bangladesh
97      Bangladesh
98      Bangladesh
99      Bangladesh
100     Bangladesh
Name: country, Length: 100, dtype: object

In [35]:
df.iloc[[0, 10, 100], [0, 2 ,4]]

         country  year  population
0    Afghanistan  1952     8425333
10   Afghanistan  2002    25268405
100   Bangladesh  1972    70759295

### Series -> single rows or single columns

In [37]:
r = df.iloc[0]

In [38]:
type(r)

pandas.core.series.Series

In [39]:
le = df['lifeExp']

In [40]:
le

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, Length: 1704, dtype: float64

In [41]:
m = le.mean()

In [42]:
m

59.474439366197174

In [44]:
len(le[le>m])

895

In [45]:
le[le>m]

14      64.820
15      66.220
16      67.690
17      68.930
18      70.420
         ...
1678    60.308
1679    62.698
1698    60.363
1699    62.351
1700    60.377
Name: lifeExp, Length: 895, dtype: float64

In [47]:
df.loc[df.lifeExp>m].head()

    country continent  year  lifeExp  population    gdpPerCap
14  Albania    Europe  1962    64.82     1728137  2312.888958
15  Albania    Europe  1967    66.22     1984060  2760.196931
16  Albania    Europe  1972    67.69     2263554  3313.422188
17  Albania    Europe  1977    68.93     2509048  3533.003910
18  Albania    Europe  1982    70.42     2780097  3630.880722

In [51]:
df.loc[(df.lifeExp>60) & (df.lifeExp<62), ['country', 'continent']].head()

                    country continent
30                  Algeria    Africa
146  Bosnia and Herzegovina    Europe
162                Botswana    Africa
173                  Brazil  Americas
279                   Chile  Americas

In [52]:
df.loc[(df.lifeExp<30) | (df.lifeExp>55), ['country', 'continent']].head()

        country continent
0   Afghanistan      Asia
12      Albania    Europe
13      Albania    Europe
14      Albania    Europe
15      Albania    Europe

In [53]:
df.loc[df.country=='India']

    country continent  year  lifeExp  population    gdpPerCap
696   India      Asia  1952   37.373   372000000   546.565749
697   India      Asia  1957   40.249   409000000   590.061996
698   India      Asia  1962   43.605   454000000   658.347151
699   India      Asia  1967   47.193   506000000   700.770611
700   India      Asia  1972   50.651   567000000   724.032527
701   India      Asia  1977   54.208   634000000   813.337323
702   India      Asia  1982   56.596   708000000   855.723538
703   India      Asia  1987   58.553   788000000   976.512676
704   India      Asia  1992   60.223   872000000  1164.406809
705   India      Asia  1997   61.765   959000000  1458.817442
706   India      Asia  2002   62.879  1034172547  1746.769454
707   India      Asia  2007   64.698  1110396331  2452.210407

### Grouping

In [57]:
df.groupby('country')['lifeExp', 'gdpPerCap'].mean().reset_index()

c:\users\jagannath\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                country    lifeExp    gdpPerCap
0           Afghanistan  37.478833   802.674598
1               Albania  68.432917  3255.366633
2               Algeria  59.030167  4426.025973
3                Angola  37.883500  3607.100529
4             Argentina  69.060417  8955.553783
..                  ...        ...          ...
137             Vietnam  57.479500  1017.712615
138  West Bank and Gaza  60.328667  3759.996781
139         Yemen, Rep.  46.780417  1569.274672
140              Zambia  45.996333  1358.199409
141            Zimbabwe  52.663167   635.858042

[142 rows x 3 columns]

### sorting

In [63]:
df.sort_values(['year', 'lifeExp'], ascending=[1, 0]).head()

          country continent  year  lifeExp  population     gdpPerCap
1140       Norway    Europe  1952    72.67     3327728  10095.421720
684       Iceland    Europe  1952    72.49      147962   7267.688428
1080  Netherlands    Europe  1952    72.13    10381988   8941.571858
1464       Sweden    Europe  1952    71.86     7124673   8527.844662
408       Denmark    Europe  1952    70.78     4334000   9692.385245

In [64]:
pd.Series([10,30, 100])

0     10
1     30
2    100
dtype: int64

In [65]:
pd.Series(['a','b','c'])

0    a
1    b
2    c
dtype: object

In [76]:
a = pd.DataFrame([[10, 20], [30,40]], columns=['A', 'B'])
a

    A   B
0  10  20
1  30  40

In [71]:
b = pd.DataFrame({'A':[50, 70], "B":[100, 200]})
b

    A    B
0  50  100
1  70  200

In [80]:
pd.concat([a,b], axis=1)

    A   B   A    B
0  10  20  50  100
1  30  40  70  200

In [74]:
pd.concat([a,b])

    A    B
0  10   20
1  30   40
0  50  100
1  70  200